/- # パイプライン演算子

Lean には右パイプライン演算子 `|>` と左パイプライン演算子 `<|` が用意されています。これは、関数適用を括弧で囲むことなく、自然な順序で記述できるようにするためのものです。
-/
/- ## 右パイプライン演算子

右パイプライン演算子 `|>` は、`a |> f` と書くことで `f a` と同じ意味になります。
-/
section --#

variable {α β : Type}

example (a : α) (f : α → β) : (a |> f) = f a := by rfl

end --#
/- これがなぜ嬉しいかというと、データに関数を次々と適用して処理していくような処理を括弧なしで、自然な順序で書くことができるからです。 -/

/-- info: 20 -/
#guard_msgs in --#
#eval [1, 2, 3, 4, 5]
  |> List.filter (· % 2 = 0)
  |> List.map (· ^ 2)
  |> List.sum

/- ## 左パイプライン演算子

左パイプライン演算子 `<|` は、`f <| a` と書くことで `f a` と同じ意味になります。
-/
section --#

variable {α β : Type}

example (a : α) (f : α → β) : (f <| a) = f a := by rfl

end --#
